"""
МОДУЛЬ 3
Программа "Личный счет"
Описание работы программы:
Пользователь запускает программу у него на счету 0
Программа предлагает следующие варианты действий
1. пополнить счет
2. покупка
3. история покупок
4. выход

1. пополнение счета
при выборе этого пункта пользователю предлагается ввести сумму на сколько пополнить счет
после того как пользователь вводит сумму она добавляется к счету
снова попадаем в основное меню

2. покупка
при выборе этого пункта пользователю предлагается ввести сумму покупки
если она больше количества денег на счете, то сообщаем что денег не хватает и переходим в основное меню
если денег достаточно предлагаем пользователю ввести название покупки, например (еда)
снимаем деньги со счета
сохраняем покупку в историю
выходим в основное меню

3. история покупок
выводим историю покупок пользователя (название и сумму)
возвращаемся в основное меню

4. выход
выход из программы

При выполнении задания можно пользоваться любыми средствами

Для реализации основного меню можно использовать пример ниже или написать свой
"""

def score(count):
    print('Вы выбрали пункт меню "Пополнить счёт"')
    print('-' * 10)
    count += float(input('Введите сумму пополнения счёта: '))
    return count

def purchase(count, dict_pur):
    print('Вы выбрали пункт меню "Покупка"')
    print('-' * 10)
    sum_pur = float(input('Введите сумму покупки: '))
    if sum_pur <= count:
        name_pur = input('Введите название покупки: ')
        count -= sum_pur
        dict_pur[name_pur] = sum_pur
    else:
        print('Денег на счете не достаточно для этой покупки!')
    return count, dict_pur

def list_pur(dict_pur):
    print('Вы выбрали пункт меню "История покупок"')
    print('-' * 10)
    for idx, itm in dict_pur.items():
        print(f'Название покупки: {idx}, Сумма покупки: {itm}')

print('Программа "ЛИЧНЫЙ СЧЁТ"')
print('*' * 20)
money = 0.0
pur_history = {}
while True:
    print('1. Пополнение счета')
    print('2. Покупка')
    print('3. История покупок')
    print('4. Выход')

    choice = input('Выберите пункт меню: ')
    if choice == '1':
        money = score(money)
        #print(money)
        print()
    elif choice == '2':
        money, pur_history = purchase(money, pur_history)
        #print(money, pur_history)
        print()
    elif choice == '3':
        list_pur(pur_history)
        print()
    elif choice == '4':
        break
    else:
        print('Неверный пункт меню')

